# import modules

In [1]:
from pandas import read_csv
import pandas as pd

# read the csv file

In [2]:
filename = 'daily_retail_price_Onion-upto_apr_2015.csv'
header_names = ['Date','Centre_Name','Commodity_Name','Price']
data = read_csv(filename,names = header_names)

# display the data

In [3]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

# simple commands

In [4]:
print(data.dtypes)

Date               object
Centre_Name        object
Commodity_Name     object
Price             float64
dtype: object

In [5]:
data.memory_usage(index=True,deep=False)

Index                 128
Date              1023288
Centre_Name       1023288
Commodity_Name    1023288
Price             1023288
dtype: int64

In [6]:
data.nlargest(5,'Price')

            Date Centre_Name Commodity_Name  Price
105648  28-10-13      AIZWAL          Onion  100.0
105933  04-11-13      AIZWAL          Onion  100.0
105990  05-11-13      AIZWAL          Onion  100.0
106047  06-11-13      AIZWAL          Onion  100.0
106104  07-11-13      AIZWAL          Onion  100.0

In [7]:
data.nsmallest(25,'Price')

           Date Centre_Name Commodity_Name  Price
9768   09-02-00   BENGALURU          Onion    2.0
10328  27-03-00     CHENNAI          Onion    2.0
10580  18-04-00     CHENNAI          Onion    2.0
10598  19-04-00     CHENNAI          Onion    2.0
11072  30-05-00      BHOPAL          Onion    2.0
11090  31-05-00      BHOPAL          Onion    2.0
11108  01-06-00      BHOPAL          Onion    2.0
11126  02-06-00      BHOPAL          Onion    2.0
11144  05-06-00      BHOPAL          Onion    2.0
11162  06-06-00      BHOPAL          Onion    2.0
11180  07-06-00      BHOPAL          Onion    2.0
11198  08-06-00      BHOPAL          Onion    2.0
11216  09-06-00      BHOPAL          Onion    2.0
11234  12-06-00      BHOPAL          Onion    2.0
11252  13-06-00      BHOPAL          Onion    2.0
11270  14-06-00      BHOPAL          Onion    2.0
11288  16-06-00      BHOPAL          Onion    2.0
11306  19-06-00      BHOPAL          Onion    2.0
11324  20-06-00      BHOPAL          Onion    2.0
11342  21-06-00      BHOPAL          Onion    2.0
11360  22-06-00      BHOPAL          Onion    2.0
11378  23-06-00      BHOPAL          Onion    2.0
11396  26-06-00      BHOPAL          Onion    2.0
11414  27-06-00      BHOPAL          Onion    2.0
11432  28-06-00      BHOPAL          Onion    2.0

# interchanging columns

In [8]:
titles = list(data.columns)
titles #titles is a list of strings

['Date', 'Centre_Name', 'Commodity_Name', 'Price']

In [9]:
titles[1], titles[2] = titles[2], titles[1]
titles

['Date', 'Commodity_Name', 'Centre_Name', 'Price']

In [10]:
data = data[titles]
data

            Date Commodity_Name      Centre_Name  Price
0       25-11-97          Onion            DELHI    8.0
1       25-11-97          Onion           SHIMLA    7.0
2       25-11-97          Onion          LUCKNOW    5.0
3       25-11-97          Onion        AHMEDABAD    6.0
4       25-11-97          Onion           BHOPAL    8.0
...          ...            ...              ...    ...
127906  28-04-15          Onion         DINDIGUL   18.0
127907  28-04-15          Onion  THIRUCHIRAPALLI   18.0
127908  28-04-15          Onion       COIMBATORE   18.0
127909  28-04-15          Onion      TIRUNELVELI   18.0
127910  28-04-15          Onion        HYDERABAD   22.0

[127911 rows x 4 columns]

# creating a new column and inserting in to the data

In [11]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing Students data 
data = {'Name': ['Ravi', 'Kavitha', 'Gaurav', 'Dharmendar'], 'Height': [5.1, 6.2, 5.1, 5.2], 'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
print(df)
# Using DataFrame.insert() to add a column 
df.insert(2, "Age", [21, 23, 24, 21], True)

# Observe the result 
df

         Name  Height Qualification
0        Ravi     5.1           Msc
1     Kavitha     6.2            MA
2      Gaurav     5.1           Msc
3  Dharmendar     5.2           Msc

         Name  Height  Age Qualification
0        Ravi     5.1   21           Msc
1     Kavitha     6.2   23            MA
2      Gaurav     5.1   24           Msc
3  Dharmendar     5.2   21           Msc

In [12]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing Students data 
data = {'Name': ['Ravi', 'Kavitha', 'Gaurav', 'Dharmendar'], 'Height': [5.9, 5.4, 5.9, 6.0], 'Qualification': ['BE', 'ME', 'B.Tech', 'Msc']} 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
df2 = df.assign(address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']) 
df2

         Name  Height Qualification    address
0        Ravi     5.9            BE      Delhi
1     Kavitha     5.4            ME  Bangalore
2      Gaurav     5.9        B.Tech    Chennai
3  Dharmendar     6.0           Msc      Patna

# overwriting columns

In [13]:
from numpy import array
from numpy import argmax
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

In [14]:
headers_name=['a','b','c','d','e']
data=read_csv("iris.csv",names=headers_name)
print(data.head())
x=array(data['e'])
label_encoder = LabelEncoder()
data['e'] = label_encoder.fit_transform(x)
# print(integer_encoded)
print(data)

     a    b    c    d            e
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
       a    b    c    d  e
0    5.1  3.5  1.4  0.2  0
1    4.9  3.0  1.4  0.2  0
2    4.7  3.2  1.3  0.2  0
3    4.6  3.1  1.5  0.2  0
4    5.0  3.6  1.4  0.2  0
..   ...  ...  ...  ... ..
145  6.7  3.0  5.2  2.3  2
146  6.3  2.5  5.0  1.9  2
147  6.5  3.0  5.2  2.0  2
148  6.2  3.4  5.4  2.3  2
149  5.9  3.0  5.1  1.8  2

[150 rows x 5 columns]